In [1]:
# Importing libraries

import numpy as np
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import getpass

#### 1. Establish a connection between Python and the Sakila database.

In [2]:
# Getting password for sql server connection

password = getpass.getpass()

········

In [3]:
# Establishing connection to sakila database

connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
# Checking it worked and we can extract data

query = '''SELECT * FROM film'''
data = pd.read_sql_query(query, engine)
data.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

#### 2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:
- engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
- month: an integer representing the month for which rental data is to be retrieved.
- year: an integer representing the year for which rental data is to be retrieved.

In [5]:
# Defining function

def rentals_month(engine: object, month: int, year: int) -> pd.DataFrame:
    
    '''
    Takes an engine object, a month and a year and returns a pandas dataframe with rental data from the sakila database from
    that month and year.
    '''
    
    query = f'''
            SELECT * FROM rental
            WHERE MONTH(rental_date) = {month}
            AND YEAR(rental_date) = {year}
            '''
    data = pd.read_sql_query(query, engine)
    return data

In [6]:
# Showing data

data = rentals_month(engine, 8, 2005)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,10181,2005-08-01 00:00:44,3111,113,2005-08-04 19:33:44,1,2006-02-15 21:30:53
1,10182,2005-08-01 00:08:01,4112,578,2005-08-09 18:14:01,2,2006-02-15 21:30:53
2,10183,2005-08-01 00:08:01,4319,377,2005-08-09 20:41:01,1,2006-02-15 21:30:53
3,10184,2005-08-01 00:09:33,2785,77,2005-08-05 04:12:33,2,2006-02-15 21:30:53
4,10185,2005-08-01 00:12:11,1266,64,2005-08-03 03:03:11,1,2006-02-15 21:30:53

#### 3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

In [7]:
# Defining function

def rental_month_count(engine: object, month: int, year: int) -> pd.DataFrame:
    
    '''
    - Takes an engine object, a month and a year
    - Retrieves information from the rental table in the sakila database according to the month and year provided
    - Groups data by customer_id
    - Renames column according to month and year in the format 'rentals_month_year'
    '''
    
    data = rentals_month(engine, month, year)
    
    formatted_month = str(month).zfill(2) # Zero-fill the month part if it's a single digit
    
    grouped_data = pd.DataFrame(data.groupby('customer_id')['rental_id'].count())
    grouped_data.rename(columns={'rental_id': f'rental_{formatted_month}_{year}'}, inplace=True)
    
    return grouped_data

In [8]:
data = rental_month_count(engine, 8, 2005)
data.head()

             rental_08_2005
customer_id
1                        11
2                        11
3                         7
4                        11
5                        13

#### 4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years.
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [9]:
def compare_rentals(engine: object, month1: int, year1: int, month2: int, year2: int) -> pd.DataFrame:
    
    '''
    - Takes an engine object, 2 months and 2 years
    - Retrieves information (2 dataframes) from the rental table in the sakila database according to the months and years provided
    - Groups data by customer_id in each of them
    - Renames column according to month and year in the format 'rentals_month_year'
    - Joins both dataframes
    - Creates a new column called 'compare_rentals' which contains the difference in rentals made by the same customer_id
    '''
    
    df1 = rental_month_count(engine, month1, year1)
    df2 = rental_month_count(engine, month2, year2)
    
    merged = df1.merge(df2, how='outer' ,on='customer_id')
    
    # if we do an outer join, a null means no rentals that month, therefore we replace nulls with zeros
    merged_clean = merged.replace(np.nan, 0)
    
    # casting values as int
    for col in merged_clean:
        merged_clean[col] = merged_clean[col].astype(int)
    
    # creating new col with the difference of the other 2
    merged_clean['difference'] = merged_clean.iloc[:, 0] - merged_clean.iloc[:, 1]
    
    return merged_clean

In [10]:
data = compare_rentals(engine, 8, 2005, 5, 2005)
data

             rental_08_2005  rental_05_2005  difference
customer_id
1                        11               2           9
2                        11               1          10
3                         7               2           5
4                        11               0          11
5                        13               3          10
...                     ...             ...         ...
595                       8               1           7
596                      13               6           7
597                      12               2          10
598                       5               0           5
599                       7               1           6

[599 rows x 3 columns]